#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/virtuosity/monday-demo/runs/run-jKUWSpdjpnvr3FGm

Waiting for the plan to start...

Terraform v1.5.0
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # alicloud_instance.ecs_instance_1 will be created
  + resource "alicloud_instance" "ecs_instance_1" {
      + availability_zone                  = (known after apply)
      + cpu                                = (known after apply)
      + credit_specification               = (known after apply)
      + deletion_protection                = false
      + deployment_set_group_no            = (known after apply)
      + dry_run                            = false
      + host_name                          = (known after apply)
      + http_endpoint                      = (known after apply)
      + http_put_response_hop_limit        = (known after apply)
      + http_tokens                        = (known after apply)
      + id                                 = (known after apply)
      + image_id                           = "aliyun_3_x64_20G_alibase_20230424.vhd"
      + instance_charge_type               = "PostPaid"
      + instance_name                      = "ECS-Instance-1"
      + instance_type                      = "ecs.t5-lc2m1.nano"
      + internet_max_bandwidth_in          = (known after apply)
      + internet_max_bandwidth_out         = 0
      + ipv6_address_count                 = (known after apply)
      + ipv6_addresses                     = (known after apply)
      + key_name                           = (known after apply)
      + maintenance_action                 = (known after apply)
      + memory                             = (known after apply)
      + network_interface_id               = (known after apply)
      + os_name                            = (known after apply)
      + os_type                            = (known after apply)
      + primary_ip_address                 = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + resource_group_id                  = "rg-aek4rvnkip7bedq"
      + role_name                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ips              = (known after apply)
      + security_groups                    = [
          + "sg-8psis5n91cq4i6zcqlb3",
        ]
      + spot_duration                      = (known after apply)
      + spot_strategy                      = (known after apply)
      + status                             = (known after apply)
      + stopped_mode                       = (known after apply)
      + subnet_id                          = (known after apply)
      + system_disk_category               = "cloud_efficiency"
      + system_disk_name                   = "ECS-Disk-1"
      + system_disk_performance_level      = (known after apply)
      + system_disk_size                   = 80
      + volume_tags                        = (known after apply)
      + vswitch_id                         = "vsw-8psjrm8g2zfrhlkhmy0sm"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecs_instance_1_id = (known after apply)

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 1 estimated
           $0.0/mo +$0.0

```
</details>
*Pushed by: @aaronkvirts, Action: `pull_request`*